app/controllers/capacities_controller.rb

SELECT * FROM "capacities" WHERE ("capacities"."id" = 1)
DELETE FROM "capacities" WHERE "id" = 1
---
  def destroy
    @capacity = Capacity.find( params[:id] )
    # remeber the id of the capacity so that we can remove it from the dom
    @capacity_id = @capacity.id
    @capacity.destroy

SELECT * FROM "capacities" WHERE ("capacities"."id" = 3)
---
  def edit
    @capacity = Capacity.find( params[:id] )

SELECT * FROM "capacities" WHERE ("capacities"."id" = 1)
---
  def show
    @capacity = Capacity.find( params[:id] )

SELECT * FROM "capacities" WHERE (available_on = '2009-09-07')
---
  def index
    if params[:focus_date]
      @focus_capacities = Capacity.all_by_availability( params[:focus_date] )
    else
      @focus_capacities = Capacity.all_by_availability( Date.today )
    end
    # added the || Date.today for the case when there are no
    # focus_capacities and a view gets rendered. Views will often
    # call strftime on the focus_date
    @focus_date = @focus_capacities.keys.first || Date.today

INSERT INTO "capacities" ("driver_id", "location", "available_on", "created_at", "fulfilled_on", "notes", "updated_at", "priority") VALUES(0, 'Kansas City', '2009-09-04 00:00:00', '2009-09-04 18:20:17', NULL, 'need a hot load', '2009-09-04 18:20:17', 0)
SELECT * FROM "capacities" WHERE (available_on = '2009-09-21')
---
  def create
    # we need the focus capacities for when an ajax request comes down the wire.
    # we respond by updating the focus table. this should only happen wheb the focus
    # date is the same date of the capacity's availability.
    @capacity = Capacity.new( params[:capacity] )
    set_or_initialize( params[:driver_name] )
    if @capacity.save!
      if params[:focus_date] == @capacity.available_on.strftime("%Y-%m-%d")
        @focus_capacities = Capacity.all_by_availability( @capacity.available_on )
        @focus_date       = @focus_capacities.keys.first

SELECT * FROM "capacities" WHERE ("capacities"."id" = 0)
UPDATE "capacities" SET "updated_at" = '2009-09-10 19:16:06', "fulfilled_on" = '2009-09-10 19:16:06' WHERE "id" = 2
---
  def update
    @capacity = Capacity.find( params[:id] )
    @capacity.fulfilled_on = DateTime.now if params[:fulfilled] == "true"
    @capacity.fulfilled_on = nil if params[:fulfilled] == "false"
    set_or_initialize( params[:driver_name] ) if params[:driver_name]
    respond_to do |format|
      if @capacity.update_attributes!( params[:capacity] )

SELECT * FROM "drivers" WHERE ("drivers"."name" IS NULL) LIMIT 1
INSERT INTO "drivers" ("name", "created_at", "updated_at") VALUES('Tim', '2009-09-12 02:14:47', '2009-09-12 02:14:47')
---
  def set_or_initialize( driver_name )
    if driver_name != ""
      driver = Driver.find_by_name( driver_name )
      if driver
        @capacity.drivers = [driver]
      else
        new_driver = Driver.create(:name => driver_name)